# 186 ~ 211p
# 4.2.3 함수적용
# 테이블 형태의 함수 적용
(df.pipe(h)
 .pipe(g, arg1=a)
 .pipe(f, arg2=b, arg3=c)
)

In [1]:
import pandas as pd
data=pd.DataFrame([[1, 1, 1], [2, 2, 2], [3, 3, 3]], index=['A', 'B', 'C'],
                  columns=['one', 'two', 'three'])
data

   one  two  three
A    1    1      1
B    2    2      2
C    3    3      3

In [2]:
def add(data, arg1):
    data1 = data + arg1
    return data1

In [3]:
def div(data1, arg2):
    data2 = data1 / arg2
    return data2

In [4]:
def mul(data2, arg3):
    data3 = data2 * arg3
    return data3

In [5]:
def sub(data3, arg4):
    data4 = data3 - arg4
    return data4

In [6]:
(data.pipe(add, arg1=2) # data에 2를 더하기
 .pipe(div, arg2=3) # data에 2를 더한 결과에 3으로 나누기
 .pipe(mul, arg3=5) # 위 결과를 3으로 나눈 후 5를 곱하기
 .pipe(sub, arg4=1) # 위 결과에서 1을 빼기
)

        one       two     three
A  4.000000  4.000000  4.000000
B  5.666667  5.666667  5.666667
C  7.333333  7.333333  7.333333

In [7]:
df = pd.DataFrame()

df['name'] = ['jsun', 'jin', 'ujung', 'naeun', 'suho']
df['sex'] = ['female', 'male', 'female', 'female', 'male']
df['age'] = [84, 58, 53, 27, 18]
df

    name     sex  age
0   jsun  female   84
1    jin    male   58
2  ujung  female   53
3  naeun  female   27
4   suho    male   18

In [8]:
def mean_age_group(dataframe, col):
    return dataframe.groupby(col).mean()
def cap_column(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [9]:
(df.pipe(mean_age_group, col='sex')
 .pipe(cap_column)
)

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_2253/3901235629.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  return dataframe.groupby(col).mean()

              AGE
sex
female  54.666667
male    38.000000

In [10]:
# 행 또는 열 단위의 함수 적용
data = [{'one': 1.0, 'two': 1.2}, {'one': 0.5, 'two': 1.1, 'three': 0.7},
        {'one': 0.7, 'two': 0.9, 'three': -1.6}, {'two': 1.4, 'three': -1.2}]
df = pd.DataFrame(data, index=list('abcd'))
df

   one  two  three
a  1.0  1.2    NaN
b  0.5  1.1    0.7
c  0.7  0.9   -1.6
d  NaN  1.4   -1.2

In [12]:
import numpy as np

df. apply(np.mean)

one      0.733333
two      1.150000
three   -0.700000
dtype: float64

In [13]:
df.apply(np.mean, axis=1)

a    1.100000
b    0.766667
c    0.000000
d    0.100000
dtype: float64

In [14]:
df.apply(lambda x: x.max() - x.min())

one      0.5
two      0.5
three    2.3
dtype: float64

In [15]:
df.apply(np.cumsum)

   one  two  three
a  1.0  1.2    NaN
b  1.5  2.3    0.7
c  2.2  3.2   -0.9
d  NaN  4.6   -2.1

In [16]:
df.apply(np.exp)

        one       two     three
a  2.718282  3.320117       NaN
b  1.648721  3.004166  2.013753
c  2.013753  2.459603  0.201897
d       NaN  4.055200  0.301194

In [17]:
df.apply('mean')

one      0.733333
two      1.150000
three   -0.700000
dtype: float64

In [18]:
df.apply('mean', axis = 1)

a    1.100000
b    0.766667
c    0.000000
d    0.100000
dtype: float64

In [22]:
# 4.2.4 Aggregation API 함수 적용

df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                  [np.nan, np.nan, np.nan]], columns = ['A', 'B', 'C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [23]:
df.agg(['sum', 'min'])

        A     B     C
sum  12.0  15.0  18.0
min   1.0   2.0   3.0

In [24]:
df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})

        A    B
sum  12.0  NaN
min   1.0  2.0
max   NaN  8.0

In [25]:
df.agg("mean", axis="columns")

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

In [28]:
adf = pd.DataFrame(np.random.randn(6, 3), columns=['A', 'B', 'C'],
                   index=pd.date_range('7/1/2021', periods=6))
adf.iloc[2:4]=np.nan
adf

                   A         B         C
2021-07-01 -2.432493  0.885125 -1.146398
2021-07-02  1.489595  1.527836  1.361094
2021-07-03       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN
2021-07-05 -0.577650  0.172482 -0.282346
2021-07-06  1.243563  1.107128 -0.329800

In [29]:
adf.agg(np.sum)

A   -0.276985
B    3.692570
C   -0.397450
dtype: float64

In [30]:
adf.agg('sum')

A   -0.276985
B    3.692570
C   -0.397450
dtype: float64

In [31]:
adf.sum()

A   -0.276985
B    3.692570
C   -0.397450
dtype: float64

In [32]:
adf.A.agg('sum')

-0.27698510856152003

In [33]:
adf.agg(['sum'])

            A        B        C
sum -0.276985  3.69257 -0.39745

In [34]:
adf.agg(['sum', 'mean'])

             A         B         C
sum  -0.276985  3.692570 -0.397450
mean -0.069246  0.923143 -0.099363

In [35]:
adf.A.agg(['sum', lambda x: x.mean()])

sum        -0.276985
<lambda>   -0.069246
Name: A, dtype: float64

In [36]:
def mymean(x):
    return x.mean()

In [37]:
adf.A.agg(['sum', mymean])

sum      -0.276985
mymean   -0.069246
Name: A, dtype: float64

In [38]:
adf.agg({'A': 'mean', 'B': 'sum'})

A   -0.069246
B    3.692570
dtype: float64

In [39]:
adf.agg({'A': ['mean', 'min'], 'B': 'sum'})

             A        B
mean -0.069246      NaN
min  -2.432493      NaN
sum        NaN  3.69257

In [42]:
df = pd.DataFrame({'A': range(3), 'B': range(1, 4)})

In [43]:
df

   A  B
0  0  1
1  1  2
2  2  3

In [44]:
df.transform(lambda x: x+1)

   A  B
0  1  2
1  2  3
2  3  4

In [45]:
adf.A.transform(np.abs)

2021-07-01    2.432493
2021-07-02    1.489595
2021-07-03         NaN
2021-07-04         NaN
2021-07-05    0.577650
2021-07-06    1.243563
Freq: D, Name: A, dtype: float64

In [46]:
adf.transform([np.abs, lambda x: x+1])

                   A                   B                   C
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2021-07-01  2.432493 -1.432493  0.885125  1.885125  1.146398 -0.146398
2021-07-02  1.489595  2.489595  1.527836  2.527836  1.361094  2.361094
2021-07-03       NaN       NaN       NaN       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN       NaN       NaN       NaN
2021-07-05  0.577650  0.422350  0.172482  1.172482  0.282346  0.717654
2021-07-06  1.243563  2.243563  1.107128  2.107128  0.329800  0.670200

In [47]:
adf.A.transform([np.abs, lambda x: x+1])

            absolute  <lambda>
2021-07-01  2.432493 -1.432493
2021-07-02  1.489595  2.489595
2021-07-03       NaN       NaN
2021-07-04       NaN       NaN
2021-07-05  0.577650  0.422350
2021-07-06  1.243563  2.243563

In [48]:
adf.transform({'A': np.abs, 'B': lambda x: x+1})

                   A         B
2021-07-01  2.432493  1.885125
2021-07-02  1.489595  2.527836
2021-07-03       NaN       NaN
2021-07-04       NaN       NaN
2021-07-05  0.577650  1.172482
2021-07-06  1.243563  2.107128

In [49]:
adf.transform({'A': np.abs, 'B': [lambda x: x+1, 'sqrt']})

                   A         B
            absolute  <lambda>      sqrt
2021-07-01  2.432493  1.885125  0.940811
2021-07-02  1.489595  2.527836  1.236056
2021-07-03       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN
2021-07-05  0.577650  1.172482  0.415310
2021-07-06  1.243563  2.107128  1.052201

In [50]:
# 요소 단위로 함수들을 적용 197p

df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [51]:
df.applymap(lambda x: len(str(x)))

   0  1
0  3  4
1  5  5

In [52]:
df.applymap(lambda x: x**2)

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [54]:
df**2

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [55]:
ser = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
ser

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [56]:
ser.map({'cat': 'kitten', 'dog': 'puppy'})

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

In [57]:
ser.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [59]:
ser.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [60]:
# 4.3 데이터 처리
# 4.3.1 데이터 선택 (라벨로 데이터 선택)

df1 = pd.DataFrame(np.random.randn(5, 4), columns=list('ABCD'),
                   index=pd.date_range('20210701', periods=5))
df1

                   A         B         C         D
2021-07-01  0.150964  0.572355  0.089256 -0.450536
2021-07-02 -0.196271 -2.658407 -0.024533  0.071960
2021-07-03  0.494832 -0.514779 -2.050268 -0.802235
2021-07-04 -0.089409  1.097499  0.971961 -1.336335
2021-07-05 -1.123132  0.637313 -0.192299 -0.265785

In [61]:
df1.loc['20210702':'20210703']

                   A         B         C         D
2021-07-02 -0.196271 -2.658407 -0.024533  0.071960
2021-07-03  0.494832 -0.514779 -2.050268 -0.802235

In [62]:
ser1 = pd.Series(np.random.randn(4), index=list('abcd'))
ser1

a   -0.438231
b    0.523679
c    0.019038
d    0.805526
dtype: float64

In [63]:
ser1.loc['c':]

c    0.019038
d    0.805526
dtype: float64

In [65]:
ser1.loc['c':] = 0
ser1

a   -0.438231
b    0.523679
c    0.000000
d    0.000000
dtype: float64

In [66]:
df1 = pd.DataFrame(np.random.randn(5, 4), index=list('abcde'), columns=list('ABCD'))
df1

          A         B         C         D
a  0.381167  0.036654 -0.504852 -1.511845
b  1.369922  0.135195  0.869908  1.837321
c  1.540843  1.087667  0.855823 -0.494462
d -0.708710 -0.096350  0.653923  0.206960
e  1.406625 -0.148334 -0.278645  1.576889

In [67]:
df1.loc[['a', 'b', 'd'], :]

          A         B         C         D
a  0.381167  0.036654 -0.504852 -1.511845
b  1.369922  0.135195  0.869908  1.837321
d -0.708710 -0.096350  0.653923  0.206960

In [68]:
df1.loc['c':, 'A':'C']

          A         B         C
c  1.540843  1.087667  0.855823
d -0.708710 -0.096350  0.653923
e  1.406625 -0.148334 -0.278645

In [69]:
df1.loc['a']

A    0.381167
B    0.036654
C   -0.504852
D   -1.511845
Name: a, dtype: float64

In [70]:
ser = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])
ser

0    a
3    b
2    c
5    d
4    e
dtype: object

In [71]:
ser.loc[3:5]

3    b
2    c
5    d
dtype: object

In [72]:
ser.sort_index()

0    a
2    c
3    b
4    e
5    d
dtype: object

In [73]:
ser.sort_index().loc[1:6]

2    c
3    b
4    e
5    d
dtype: object

In [74]:
# 위치로 데이터 선택

ser1 = pd.Series(np.random.randn(5), index=list(range(0, 10 ,2)))
ser1

0    0.222606
2    1.582071
4    0.241269
6    0.159785
8   -0.622209
dtype: float64

In [76]:
ser1.iloc[:3]

0    0.222606
2    1.582071
4    0.241269
dtype: float64

In [77]:
ser1.iloc[3]

0.15978503907072844

In [80]:
df1 = pd.DataFrame(np.random.randn(5, 4), index = list(range(0, 10, 2)),
                   columns=list(range(0, 8, 2)))
df1

          0         2         4         6
0  0.343234  0.670439 -1.402145  0.789168
2 -0.228143  1.955201  0.899417 -0.048015
4  1.330627  0.150698 -0.448212  1.484681
6  0.709871 -0.177697 -0.049553 -1.000848
8 -0.332243  0.835645 -0.758691  0.154716

In [81]:
df1.iloc[:2]

          0         2         4         6
0  0.343234  0.670439 -1.402145  0.789168
2 -0.228143  1.955201  0.899417 -0.048015

In [83]:
df1.iloc[1:3, 0:3]

          0         2         4
2 -0.228143  1.955201  0.899417
4  1.330627  0.150698 -0.448212

In [84]:
df1.iloc[[0, 2, 3], [1, 3]]

          2         6
0  0.670439  0.789168
4  0.150698  1.484681
6 -0.177697 -1.000848

In [85]:
df1.iloc[1]

0   -0.228143
2    1.955201
4    0.899417
6   -0.048015
Name: 2, dtype: float64

In [86]:
# 호출 함수로 데이터 선택

df1 = pd.DataFrame(np.random.randn(5, 4), index = list('abcde'), columns = list('ABCD'))
df1

          A         B         C         D
a  0.103439 -0.894513  0.814432 -0.794185
b -0.449587 -0.218802 -0.261084  0.382511
c  0.124263  0.125792 -1.744163  0.726349
d  0.302120  0.934372  0.116960  0.608939
e  0.055248  0.340434 -0.712304 -1.617540

In [87]:
df1.loc[lambda df: df.A>0, :]

          A         B         C         D
a  0.103439 -0.894513  0.814432 -0.794185
c  0.124263  0.125792 -1.744163  0.726349
d  0.302120  0.934372  0.116960  0.608939
e  0.055248  0.340434 -0.712304 -1.617540

In [88]:
df1.loc[:, lambda df: ['A', 'B']]

          A         B
a  0.103439 -0.894513
b -0.449587 -0.218802
c  0.124263  0.125792
d  0.302120  0.934372
e  0.055248  0.340434

In [89]:
df1.iloc[:, lambda df: [0, 1]]

          A         B
a  0.103439 -0.894513
b -0.449587 -0.218802
c  0.124263  0.125792
d  0.302120  0.934372
e  0.055248  0.340434

In [90]:
df1[lambda df: df.columns[0]]

a    0.103439
b   -0.449587
c    0.124263
d    0.302120
e    0.055248
Name: A, dtype: float64

In [91]:
df1.A.loc[lambda ser: ser > 0]

a    0.103439
c    0.124263
d    0.302120
e    0.055248
Name: A, dtype: float64

In [92]:
# 4.3.2 데이터 설정과 검색

ser = pd.Series(np.arange(3))
ser

0    0
1    1
2    2
dtype: int64

In [94]:
ser[5] = 7
ser

0    0
1    1
2    2
5    7
dtype: int64

In [96]:
df = pd.DataFrame(np.arange(9).reshape(3, 3), columns=['A', 'B', 'C'])
df

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [97]:
df.loc[:, 'D'] = df.loc[:, 'A']
df

   A  B  C  D
0  0  1  2  0
1  3  4  5  3
2  6  7  8  6

In [99]:
df.loc[3] = 7
df

   A  B  C  D
0  0  1  2  0
1  3  4  5  3
2  6  7  8  6
3  7  7  7  7

In [100]:
ser.iat[3]

7

In [101]:
ser.at[5]

7

In [103]:
df.at[3, 'E'] = 7
df.iat[3, 0] = 2
df

   A  B  C  D    E
0  0  1  2  0  NaN
1  3  4  5  3  NaN
2  6  7  8  6  NaN
3  2  7  7  7  7.0

In [104]:
# 불리언 벡터로 데이터 필터링

ser = pd.Series(range(-3, 3))
ser

0   -3
1   -2
2   -1
3    0
4    1
5    2
dtype: int64

In [105]:
ser[ser>0]

4    1
5    2
dtype: int64

In [106]:
ser[(ser<-1)|(ser>1)]

0   -3
1   -2
5    2
dtype: int64

In [107]:
ser[~(ser<2)]

5    2
dtype: int64

In [108]:
df[df['A']<3]

   A  B  C  D    E
0  0  1  2  0  NaN
3  2  7  7  7  7.0

In [109]:
ser[::-1].isin([-3, -1, 2])

5     True
4    False
3    False
2     True
1    False
0     True
dtype: bool

In [110]:
ser[ser[::-1].isin([-3, -1, 2])]

0   -3
2   -1
5    2
dtype: int64

In [111]:
ser.index.isin([2, 4, 6])

array([False, False,  True, False,  True, False])

In [112]:
ser[ser.index.isin([2, 4, 6])]

2   -1
4    1
dtype: int64

In [113]:
df = pd.DataFrame({'no': [1, 2, 3], 'ha': ['a', 'b', 'c'], 'hi': ['m', 'n', 'o']})
val = ['a', 'n', 1, 3]
df

   no ha hi
0   1  a  m
1   2  b  n
2   3  c  o

In [114]:
df.isin(val)

      no     ha     hi
0   True   True  False
1  False  False   True
2   True  False  False

In [115]:
val = {'ha': ['a', 'c'], 'no': [1, 2]}
df.isin(val)

      no     ha     hi
0   True   True  False
1   True  False  False
2  False   True  False

In [116]:
val = {'ha': ['a', 'c'], 'hi': ['m', 'o'], 'no': [1, 2]}
mask = df.isin(val).all(1)

In [117]:
df[mask]

   no ha hi
0   1  a  m

In [118]:
# task 메소드로 검색

index = pd.Index(np.random.randint(0, 1000, 6))
index

Int64Index([85, 846, 79, 222, 201, 791], dtype='int64')

In [120]:
positions = [0, 2, 5]
index[positions]

Int64Index([85, 79, 791], dtype='int64')

In [122]:
index.take(positions)

Int64Index([85, 79, 791], dtype='int64')

In [123]:
ser = pd.Series(np.random.randn(10))
ser.iloc[positions]

0   -0.466720
2    0.135585
5    1.388309
dtype: float64

In [126]:
ser.take(positions)

0   -0.466720
2    0.135585
5    1.388309
dtype: float64

In [127]:
df = pd.DataFrame(np.random.randn(5, 3))
df.take([1, 4, 3])

          0         1         2
1 -0.311151  1.340270 -0.919854
4 -0.724702  0.238594 -1.438174
3  1.341542  0.864370 -0.667070

In [129]:
df.take([0, 2], axis=1)

          0         2
0 -1.136496 -1.771128
1 -0.311151 -0.919854
2  0.146135 -0.931122
3  1.341542 -0.667070
4 -0.724702 -1.438174